; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	infrared0 - mode
	thermograph1 - mode
	GroundStation5 - direction
	GroundStation1 - direction
	Star0 - direction
	GroundStation8 - direction
	Star7 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star6 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star7)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star4)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation8)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star7)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon14)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star6)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
	(supports instrument8 thermograph1)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star6)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation5)
)
(:goal (and
	(pointing satellite0 Phenomenon14)
	(pointing satellite2 Star13)
	(pointing satellite4 GroundStation2)
	(have_image Planet9 thermograph1)
	(have_image Phenomenon10 infrared0)
	(have_image Star11 infrared0)
	(have_image Phenomenon12 infrared0)
	(have_image Star13 thermograph1)
	(have_image Phenomenon14 infrared0)
	(have_image Planet15 thermograph1)
))

)

; plan
1. (turn_to satellite4 groundstation2 groundstation5)
   deleted: (pointing satellite4 groundstation5)
   added: (pointing satellite4 groundstation2)
   goals met: 1 of 10
2. (turn_to satellite2 groundstation2 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 groundstation2)
   goals met: 1 of 10
3. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 10
4. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 1 of 10
5. (turn_to satellite2 phenomenon14 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon14)
   goals met: 1 of 10
6. (take_image satellite2 phenomenon14 instrument5 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 2 of 10
7. (turn_to satellite2 phenomenon12 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon12)
   goals met: 2 of 10
8. (take_image satellite2 phenomenon12 instrument5 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 3 of 10
9. (turn_to satellite2 phenomenon10 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon14 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 10
11. (take_image satellite2 phenomenon10 instrument5 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 5 of 10
12. (turn_to satellite2 planet15 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet15)
   goals met: 5 of 10
13. (take_image satellite2 planet15 instrument5 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 6 of 10
14. (turn_to satellite2 planet9 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet9)
   goals met: 6 of 10
15. (take_image satellite2 planet9 instrument5 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 7 of 10
16. (turn_to satellite2 star11 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star11)
   goals met: 7 of 10
17. (take_image satellite2 star11 instrument5 infrared0)
   added: (have_image star11 infrared0)
   goals met: 8 of 10
18. (turn_to satellite2 star13 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star13)
   goals met: 9 of 10
19. (take_image satellite2 star13 instrument5 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 10 of 10
